modules/publishing/freemacs-academic-writing.org
# -*-eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t);-*-

#+title: Academic Phrases Configuration
#+author: Thomas Freeman
#+date: Time-stamp: <2022-07-07 17:21:26 thomas>
#+language: en_US
#+property: header-args :results silent :exports code

#+options: html-link-use-abs-url:nil html-postamble:auto
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+keywords: Emacs
#+html_link_home: ../../index.html
#+html_link_up: ../../init.html
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)
#+html_head: <style>#org-div-home-and-up { text-align: right; padding-right: 10pt; }</style>

#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup



* Academic Phrases

[[https://github.com/nashamri/academic-phrases][Academic phrases]] is a package that provides a number of easy-to-use templates for writing academic text if you happen to have writer's block. Calling the function ~M-x academic-phrases~ provides a searchable list of these templates for your use.

#+begin_src emacs-lisp :tangle yes
  (use-package academic-phrases
    :straight t
    :defer t)
#+end_src

* Citar

[[https://github.com/emacs-citar/citar][Citar]] is a citation tool that integrates well with Vertico, Embark, and Marginalia.

#+begin_src emacs-lisp :tangle yes
  (use-package citar
    :straight (citar :host github
                     :repo "emacs-citar/citar"
                     :branch "main")
    :defer t
    :after org
    :custom
    (citar-bibliography org-cite-global-bibliography))
#+end_src

Tell Org Cite to use Citar.

#+begin_src emacs-lisp :noweb-ref org_cite_custom
  (org-cite-insert-processor 'citar)
  (org-cite-follow-processor 'citar)
  (org-cite-activate-processor 'citar)
#+end_src

* Org Cite :org:

Org Cite is a feature to add citation capabilities to Org Mode. The following lines will tell Org Mode to use Citar as the processor for ~org-cite~ and will tell Org Mode where to find the default bibliography file.

#+begin_src emacs-lisp :tangle yes :noweb yes
  (use-package oc
    :defer t
    :custom
    (org-cite-global-bibliography '("~/bib/bib.bib"))
    <<org_cite_custom>>)
#+end_src

* End

#+begin_src emacs-lisp :tangle yes
  (provide 'freemacs-academic-writing)

  ;;; freemacs-academic-writing.el ends here
#+end_src
