docs/modules/publishing/freemacs-academic-writing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en_US" xml:lang="en_US">
<head>
<!-- 2022-07-07 Thu 20:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Academic Phrases Configuration</title>
<meta name="author" content="Thomas Freeman" />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../init.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Academic Phrases Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga7eb406">Academic Phrases</a></li>
<li><a href="#org4ec6195">Citar</a></li>
<li><a href="#org9609633">Org Cite&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></a></li>
<li><a href="#org476c8f5">End</a></li>
</ul>
</div>
</div>
<hr />


<div id="outline-container-orga7eb406" class="outline-2">
<h2 id="orga7eb406">Academic Phrases</h2>
<div class="outline-text-2" id="text-orga7eb406">
<p>
<a href="https://github.com/nashamri/academic-phrases">Academic phrases</a> is a package that provides a number of easy-to-use templates for writing academic text if you happen to have writer's block. Calling the function <code>M-x academic-phrases</code> provides a searchable list of these templates for your use.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">academic-phrases</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:defer</span> t<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ec6195" class="outline-2">
<h2 id="org4ec6195">Citar</h2>
<div class="outline-text-2" id="text-org4ec6195">
<p>
<a href="https://github.com/emacs-citar/citar">Citar</a> is a citation tool that integrates well with Vertico, Embark, and Marginalia.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">citar</span>
  <span style="color: #1ea8fc;">:straight</span> <span style="color: #ff2afc;">(</span>citar <span style="color: #1ea8fc;">:host</span> github
                   <span style="color: #1ea8fc;">:repo</span> <span style="color: #7984D1;">"emacs-citar/citar"</span>
                   <span style="color: #1ea8fc;">:branch</span> <span style="color: #7984D1;">"main"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:after</span> org
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>citar-bibliography org-cite-global-bibliography<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
Tell Org Cite to use Citar.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-cite-insert-processor 'citar<span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>org-cite-follow-processor 'citar<span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>org-cite-activate-processor 'citar<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9609633" class="outline-2">
<h2 id="org9609633">Org Cite&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></h2>
<div class="outline-text-2" id="text-org9609633">
<p>
Org Cite is a feature to add citation capabilities to Org Mode. The following lines will tell Org Mode to use Citar as the processor for <code>org-cite</code> and will tell Org Mode where to find the default bibliography file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">oc</span>
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>org-cite-global-bibliography '<span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"~/bib/bib.bib"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-cite-insert-processor 'citar<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-cite-follow-processor 'citar<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-cite-activate-processor 'citar<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org476c8f5" class="outline-2">
<h2 id="org476c8f5">End</h2>
<div class="outline-text-2" id="text-org476c8f5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">provide</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-academic-writing</span><span style="color: #1ea8fc;">)</span>

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">freemacs-academic-writing.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Time-stamp: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-07 Thu 20:16&gt;</span></span></p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-07-07 Thu 20:20</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
